#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/businesscompanyllc/businesscompanyllc-github/runs/run-6SBb4cGh3iwm8URm

Waiting for the plan to start...

Terraform v1.0.10
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_membership.user_0 will be created
  + resource "github_membership" "user_0" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "kdmccormick"
    }

  # github_membership.user_1 will be created
  + resource "github_membership" "user_1" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "sarina"
    }

  # github_team.organization_managers will be created
  + resource "github_team" "organization_managers" {
      + create_default_maintainer = false
      + description               = "People who can manager our GH org by merging to github-configuration."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "organization-managers"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.membership_for_user_1 will be created
  + resource "github_team_membership" "membership_for_user_1" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "sarina"
    }

  # module.repository_core_platform.github_branch.master will be created
  + resource "github_branch" "master" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "core-platform"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.repository_core_platform.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "core-platform"
    }

  # module.repository_core_platform.github_branch_protection.protect_default_branch will be created
  + resource "github_branch_protection" "protect_default_branch" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "master"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.repository_core_platform.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Our highly extensible, self-contained, micro-service, mono-repo, polyglot, no-code, yes-farms, yes-food, platform core. Now available in Python 2.6."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "core-platform"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.repository_github_configuration.github_branch.master will be created
  + resource "github_branch" "master" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "github-configuration"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.repository_github_configuration.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "github-configuration"
    }

  # module.repository_github_configuration.github_branch_protection.protect_default_branch will be created
  + resource "github_branch_protection" "protect_default_branch" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "master"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "Terraform",
            ]
          + strict   = false
        }
    }

  # module.repository_github_configuration.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "GitHub organization configuration-as-code, includinging permissions, teams, and repositories."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "github-configuration"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.repository_innovation_plugin.github_branch.master will be created
  + resource "github_branch" "master" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "innovation-plugin"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.repository_innovation_plugin.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "innovation-plugin"
    }

  # module.repository_innovation_plugin.github_branch_protection.protect_default_branch will be created
  + resource "github_branch_protection" "protect_default_branch" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "master"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_innovation_plugin.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "A core platform plugin to inspire synergistic acceleration alignment"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "innovation-plugin"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.repository_spa_frontend.github_branch.master will be created
  + resource "github_branch" "master" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "spa-frontend"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.repository_spa_frontend.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "spa-frontend"
    }

  # module.repository_spa_frontend.github_branch_protection.protect_default_branch will be created
  + resource "github_branch_protection" "protect_default_branch" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "master"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_spa_frontend.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Kick back and relax, it's a single-page app."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "spa-frontend"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true

      + template {
          + owner      = "react-boilerplate"
          + repository = "react-boilerplate"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @kdmccormick, Action: `pull_request`*